--------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /usr/local/ifs/gsb/mcorrito/create_master.log
  log type:  text
 opened on:   5 Mar 2020, 14:37:30

. log off
      name:  <unnamed>
       log:  /usr/local/ifs/gsb/mcorrito/create_master.log
  log type:  text
 paused on:   5 Mar 2020, 14:37:30
--------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /usr/local/ifs/gsb/mcorrito/create_master.log
  log type:  text
resumed on:   5 Mar 2020, 15:24:15

. sum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
    bgtjobid | 11,106,938    2.72e+10    1.71e+10         61   3.85e+10
         soc | 11,106,938    314780.6    140519.9     111011     553019
        year | 11,106,938    2015.276    2.528634       2010       2018
   minsalary | 11,106,938    51621.67    35468.74      10000     200000
   maxsalary | 11,106,938    65768.03    52524.39      10010     500000
-------------+---------------------------------------------------------
         msa | 11,106,938    30692.82    11179.17      10100      49820
         edu | 11,106,938    7.941977    7.350061          0         21
         exp | 11,106,938    1.482814    2.282895          0         15
       orgid | 11,106,938    359452.6    206096.6          1     678750
    bundleid | 11,106,938    178959.6    88571.58          1     314628

. foreach var of varlist * {
  2. sum `var',d
  3. }

                          bgtjobid
-------------------------------------------------------------
      Percentiles      Smallest
 1%      5534479             61
 5%     1.11e+08             68
10%     1.46e+08             73       Obs          11,106,938
25%     4.22e+08            105       Sum of Wgt.    11106938

50%     3.80e+10                      Mean           2.72e+10
                        Largest       Std. Dev.      1.71e+10
75%     3.84e+10       3.85e+10
90%     3.84e+10       3.85e+10       Variance       2.93e+20
95%     3.84e+10       3.85e+10       Skewness      -.9332105
99%     3.85e+10       3.85e+10       Kurtosis       1.880149

                             soc
-------------------------------------------------------------
      Percentiles      Smallest
 1%       112021         111011
 5%       119032         111011
10%       119199         111011       Obs          11,106,938
25%       152031         111011       Sum of Wgt.    11106938

50%       311011                      Mean           314780.6
                        Largest       Std. Dev.      140519.9
75%       434051         553019
90%       514041         553019       Variance       1.97e+10
95%       533032         553019       Skewness      -.0210552
99%       537062         553019       Kurtosis       1.650209

                            year
-------------------------------------------------------------
      Percentiles      Smallest
 1%         2010           2010
 5%         2011           2010
10%         2011           2010       Obs          11,106,938
25%         2013           2010       Sum of Wgt.    11106938

50%         2016                      Mean           2015.276
                        Largest       Std. Dev.      2.528634
75%         2018           2018
90%         2018           2018       Variance       6.393989
95%         2018           2018       Skewness      -.5675518
99%         2018           2018       Kurtosis       2.131096

                          minsalary
-------------------------------------------------------------
      Percentiles      Smallest
 1%        15080          10000
 5%        18720          10000
10%        20800          10000       Obs          11,106,938
25%      27497.6          10000       Sum of Wgt.    11106938

50%        40456                      Mean           51621.67
                        Largest       Std. Dev.      35468.74
75%        62613         200000
90%        97760         200000       Variance       1.26e+09
95%       120000         200000       Skewness       2.032623
99%       200000         200000       Kurtosis       7.903918

                          maxsalary
-------------------------------------------------------------
      Percentiles      Smallest
 1%        16640          10010
 5%        20800          10010
10%        23920          10010       Obs          11,106,938
25%        31200          10010       Sum of Wgt.    11106938

50%        51000                      Mean           65768.03
                        Largest       Std. Dev.      52524.39
75%        81960         500000
90%       120000         500000       Variance       2.76e+09
95%       153800         500000       Skewness       3.111171
99%       286000         500000       Kurtosis       18.72377

                             msa
-------------------------------------------------------------
      Percentiles      Smallest
 1%        10740          10100
 5%        12420          10100
10%        14460          10100       Obs          11,106,938
25%        19740          10100       Sum of Wgt.    11106938

50%        32820                      Mean           30692.82
                        Largest       Std. Dev.      11179.17
75%        40220          49820
90%        44700          49820       Variance       1.25e+08
95%        47300          49820       Skewness        -.22136
99%        48620          49820       Kurtosis       1.772301

                             edu
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,106,938
25%            0              0       Sum of Wgt.    11106938

50%           12                      Mean           7.941977
                        Largest       Std. Dev.      7.350061
75%           16             21
90%           16             21       Variance        54.0234
95%           18             21       Skewness      -.0339583
99%           21             21       Kurtosis       1.248282

                             exp
-------------------------------------------------------------
      Percentiles      Smallest
 1%            0              0
 5%            0              0
10%            0              0       Obs          11,106,938
25%            0              0       Sum of Wgt.    11106938

50%          .08                      Mean           1.482814
                        Largest       Std. Dev.      2.282895
75%            2             15
90%            5             15       Variance        5.21161
95%            5             15       Skewness       2.314008
99%           10             15       Kurtosis       9.965364

                    group(fuzzyemployer)
-------------------------------------------------------------
      Percentiles      Smallest
 1%        10445              1
 5%        39097              1
10%        79647              1       Obs          11,106,938
25%       174411              2       Sum of Wgt.    11106938

50%       365777                      Mean           359452.6
                        Largest       Std. Dev.      206096.6
75%       559929         678750
90%       632415         678750       Variance       4.25e+10
95%       644021         678750       Skewness      -.0623333
99%       673497         678750       Kurtosis       1.637107

                     group(skill_bundle)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%         7602              1
10%        31842              1       Obs          11,106,938
25%       135258              1       Sum of Wgt.    11106938

50%       161263                      Mean           178959.6
                        Largest       Std. Dev.      88571.58
75%       254486         314628
90%       297924         314628       Variance       7.84e+09
95%       309403         314628       Skewness      -.2598103
99%       314254         314628       Kurtosis       2.352287

. log off
      name:  <unnamed>
       log:  /usr/local/ifs/gsb/mcorrito/create_master.log
  log type:  text
 paused on:   5 Mar 2020, 15:26:47
--------------------------------------------------------------------------------------------------------------------------------
--------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /usr/local/ifs/gsb/mcorrito/create_master.log
  log type:  text
resumed on:   5 Mar 2020, 15:26:47

. distinct soc

       |        Observations
       |      total   distinct
-------+----------------------
   soc |   1.11e+07        828

. distinct msa

       |        Observations
       |      total   distinct
-------+----------------------
   msa |   1.11e+07        929

. distinct year

       |        Observations
       |      total   distinct
-------+----------------------
  year |   1.11e+07          9

. distinct orgid

       |        Observations
       |      total   distinct
-------+----------------------
 orgid |   1.11e+07     678750

. distinct bundleid

          |        Observations
          |      total   distinct
----------+----------------------
 bundleid |   1.11e+07     314628

. log off
      name:  <unnamed>
       log:  /usr/local/ifs/gsb/mcorrito/create_master.log
  log type:  text
 paused on:   5 Mar 2020, 15:27:47
--------------------------------------------------------------------------------------------------------------------------------
